ibGraduateWork/src/Documents/УстановкаОкладаСотруднику/УстановкаОкладаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаОкладаСотруднику</name>
  <registerRecords>InformationRegister.СведенияОСотрудниках</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОклада</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
  </attributes>
</mdclass:Document>

ibGraduateWork/src/InformationRegisters/СведенияОСотрудниках/СведенияОСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОСотрудниках</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ibGraduateWork/src/Documents/УстановкаОкладаСотруднику/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.СведенияОСотрудниках.Записывать = Истина;
	Движение = Движения.СведенияОСотрудниках.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Должность = Должность;
	Движение.Оклад = СуммаОклада;
КонецПроцедуры
